'''
Створіть 2 змінні x та y з довільними значеннями;
Створіть просту умовну конструкцію(звісно вона повинна бути в тілі ф-ції), 
під час виконання якої буде перевірятися рівність змінних x та y.
Удоскональте конструкцію та додайте відповідні умови, які б при нерівності 
змінних х та у відповідь повертали різницю чисел.
Повинні опрацювати такі умови:
x > y;       відповідь - х більше ніж у на z
x < y;       відповідь - у більше ніж х на z
x==y.     відповідь - х дорівнює z
'''
from builtins import str



def func(x,y):
    if(x == y):
        z = x
        return x + "дорівнює" + z
    elif(x > y):
        z = x - y
        return str(x) + " більше ніж " + str(y) + " на " + str(z)
    else:
        z = y - x
        return str(y) + " більше ніж " + str(x) + " на " + str(z)

        
x,y = 16,42
print(func(x, y))